## Introduction and Observinig the data

In this Project we will work on House dataset and will predict the price of the house.

In [86]:
#import necessary files
import pandas as pd
import numpy as np

In [87]:
house_df = pd.read_csv("Bengaluru_House_Data.csv")

In [88]:
house_df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [89]:
house_df.shape

(13320, 9)

In [90]:
house_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

Have some either missing or null values in the dataset

In [91]:
# Check the counts of each column
for colum in house_df.columns:
    print(house_df[colum].value_counts())
    print('--'*50)

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
----------------------------------------------------------------------------------------------------
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
----------------------------------------------------------------------------------------------------
location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64
----------------------------------------------------------------------------------------------------
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64
----------------------------------------------------------------------------------------------------
society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64
----------------------------------------------------------------------------------------------------
total_sqft
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: count, Length: 2117, dtype: int64
----------------------------------------------------------------------------------------------------
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64
----------------------------------------------------------------------------------------------------
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
----------------------------------------------------------------------------------------------------
price
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: count, Length: 1994, dtype: int64
----------------------------------------------------------------------------------------------------

In [92]:
house_df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [93]:
house_df.drop(columns = ['area_type','availability','society','balcony'],inplace=True)

In [94]:
house_df.shape

(13320, 5)

In [95]:
house_df.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [96]:
house_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

## Data Cleaning

Cleaning the Data while Removing any Outliers

In [97]:
house_df['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [98]:
# Fill missing values
house_df['location'] = house_df['location'].fillna('Sarjapur  Road')

In [99]:
house_df['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [100]:
# filling size column missing values
house_df['size'] = house_df['size'].fillna('2 BHK')

In [101]:
house_df['bhk']= house_df['size'].str.split().str.get(0).astype(int)

In [102]:
house_df[house_df['bhk'] >20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [103]:
house_df['bath'].value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64

In [104]:
# filling bathroom null values
house_df['bath'] = house_df['bath'].fillna(house_df['bath'].median())

In [105]:
house_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
 5   bhk         13320 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 624.5+ KB

In [106]:
# sq feet is in object need to convert into int or float
house_df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

We need to convert the string to float. also sort the range string to float by taking the mean

In [107]:
# define a function to convert the string to float
def converttofloat(x):
    temp = x.split('-')
    if len(temp) == 2:
        return ((float(temp[0]) + float(temp[1])))/2
    try:
        return float(x)
    except: 
        return None

In [108]:
house_df['total_sqft'] = house_df['total_sqft'].apply(converttofloat)

In [109]:
house_df.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [110]:
house_df.describe()

         total_sqft          bath         price           bhk
count  13274.000000  13320.000000  13320.000000  13320.000000
mean    1559.626694      2.688814    112.565627      2.802778
std     1238.405258      1.338754    148.971674      1.294496
min        1.000000      1.000000      8.000000      1.000000
25%     1100.000000      2.000000     50.000000      2.000000
50%     1276.000000      2.000000     72.000000      3.000000
75%     1680.000000      3.000000    120.000000      3.000000
max    52272.000000     40.000000   3600.000000     43.000000

In [111]:
# let us create a price for sq foot. the price is lakhs as stated in the description of the datset
house_df['price_per_sq_foot'] = (house_df['price']*100000) / house_df['total_sqft']

In [112]:
house_df.describe()

,total_sqft,bath,price,bhk,price_per_sq_foot
count,13274.000000,13320.000000,13320.000000,13320.000000,1.327400e+04
mean,1559.626694,2.688814,112.565627,2.802778,7.907501e+03
std,1238.405258,1.338754,148.971674,1.294496,1.064296e+05
min,1.000000,1.000000,8.000000,1.000000,2.678298e+02
25%,1100.000000,2.000000,50.000000,2.000000,4.266865e+03
50%,1276.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1680.000000,3.000000,120.000000,3.000000,7.311746e+03
max,52272.000000,40.000000,3600.000000,43.000000,1.200000e+07

In [113]:
house_df['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    400
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [114]:
# removing any unnecessary spaces form the string
house_df['location'] = house_df['location'].apply(lambda x: x.strip())

In [115]:
# romve the count of the places where the count is only one or two.
location_count = house_df['location'].value_counts()
location_count_less_than_10 = location_count[location_count < 10]
house_df['location'] = house_df['location'].apply(lambda x: 'other'  if x in location_count_less_than_10 else x)

In [116]:
house_df['location'].value_counts()

location
other                  2755
Whitefield              541
Sarjapur  Road          400
Electronic City         304
Kanakpura Road          273
                       ...
BTM 1st Stage            10
Basapura                 10
Sector 1 HSR Layout      10
Kalkere                  10
Nagadevanahalli          10
Name: count, Length: 255, dtype: int64

In [117]:
# Check the outlier in sqft
# get the sqft per bhk
(house_df['total_sqft'] / house_df['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

We have bedroom with teh 0.25 sqft which is logically cannot be true. Hence Going to remove the ouliers.

In [118]:
# Get the data where minimum sqft is 300 per one bedroom
house_df = house_df[((house_df['total_sqft'] / house_df['bhk']) >= 300)]

In [119]:
house_df.shape

(12530, 7)

In [120]:
#time to chek the preice per sqft
house_df.price_per_sq_foot.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sq_foot, dtype: float64

We have outliers even in Price per Sq Foot

In [121]:
# remove existing ouliers and keep the data around the mean to make a normal distribution
def remove_sqft_outlier(df):
    output_df = pd.DataFrame()
    for key,sub_df in df.groupby('location'):
        mean_sqft = np.mean(sub_df['price_per_sq_foot'])
        std_sqft = np.std(sub_df['price_per_sq_foot'])
        new_df = sub_df[(sub_df['price_per_sq_foot'] > (mean_sqft - std_sqft)) 
                        & 
                        (sub_df['price_per_sq_foot'] <= (mean_sqft + std_sqft))]
        output_df = pd.concat([output_df,new_df],ignore_index=True)
    return output_df

In [122]:
house_df = remove_sqft_outlier(house_df)

In [123]:
house_df.shape

(10282, 7)

In [124]:
house_df.describe()

,total_sqft,bath,price,bhk,price_per_sq_foot
count,10282.000000,10282.000000,10282.000000,10282.000000,10282.000000
mean,1509.996956,2.474032,91.718675,2.576347,5669.007067
std,883.210082,0.986908,88.327858,0.900592,2292.794131
min,300.000000,1.000000,10.000000,1.000000,1250.000000
25%,1110.000000,2.000000,49.000000,2.000000,4249.917219
50%,1286.000000,2.000000,67.000000,2.000000,5176.565008
75%,1650.000000,3.000000,100.000000,3.000000,6431.808627
max,30400.000000,16.000000,2200.000000,16.000000,24509.803922

In [125]:
# Remove outliers in bhk 
def remove_bhk_outlier(df):
    exclude_indices = np.array([])
    for key,loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean' : np.mean(bhk_df['price_per_sq_foot']),
                'std' : np.std(bhk_df['price_per_sq_foot']),
                'count' : bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk -1 )
            if stats and stats['count'] >5:
                exclude_indices = np.append(exclude_indices,bhk_df[bhk_df['price_per_sq_foot']<(stats['mean'])].index.values)  
    return df.drop(exclude_indices,axis='index')

In [126]:
house_df = remove_bhk_outlier(house_df)

In [127]:
house_df.shape

(7401, 7)

In [128]:
house_df

,location,size,total_sqft,bath,price,bhk,price_per_sq_foot
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.0,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.0,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.0,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.0,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...
10273,other,2 BHK,1200.0,2.0,70.0,2,5833.333333
10274,other,1 BHK,1800.0,1.0,200.0,1,11111.111111
10277,other,2 BHK,1353.0,2.0,110.0,2,8130.081301
10278,other,1 Bedroom,812.0,1.0,26.0,1,3201.970443
10281,other,4 BHK,3600.0,5.0,400.0,4,11111.111111

In [129]:
house_df.drop(columns=['size','price_per_sq_foot'],inplace=True)

In [130]:
#Save cleanded data
house_df.to_csv("Cleaned_Bengaluru_House_Data.csv")

## Feature Selection and Modeling

In [131]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Ridge,Lasso
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.ensemble import RandomForestRegressor
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score,mean_squared_error, mean_absolute_error

In [132]:
house_df.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [133]:
house_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7401 entries, 0 to 10281
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    7401 non-null   object
 1   total_sqft  7401 non-null   float64
 2   bath        7401 non-null   float64
 3   price       7401 non-null   float64
 4   bhk         7401 non-null   int64
dtypes: float64(3), int64(1), object(1)
memory usage: 346.9+ KB

In [134]:
# select x and y
X = house_df.drop('price', axis=1)
y = house_df['price']
# train tests split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [135]:
cat_cols = ['location']
num_cols = ['total_sqft','bath','bhk']

In [136]:
#preprocessing
pre_processor = make_column_transformer(
    (OneHotEncoder(sparse_output=False,handle_unknown='ignore'),cat_cols),
    (StandardScaler(),num_cols),remainder='passthrough'
)

In [137]:
# Lasso
models = {
    'Linear Regression': LinearRegression(),
    'Ridge' : Ridge(),
    'Lasso': Lasso(),
    'Random Forest Regressor': RandomForestRegressor()
}

# loop thorough obj models
for name,model in models.items():
    #create a pipe
    pipe = make_pipeline(pre_processor,model)
    # Fit
    pipe.fit(X_train,y_train)
    # predict
    y_predict = pipe.predict(X_test)
    print(f"\n{name} : {r2_score(y_test,y_predict)}")
    print(f"R2 Score: {r2_score(y_test,y_predict)}")
    print(f"MAE: {mean_absolute_error(y_test,y_predict)}")
    print(f"RMSE: {mean_squared_error(y_test,y_predict)}")
    print('--'*50)

Linear Regression : 0.8096358642433913
R2 Score: 0.8096358642433913
MAE: 19.651061919371013
RMSE: 1899.6776954284467
----------------------------------------------------------------------------------------------------

Ridge : 0.8036513266285875
R2 Score: 0.8036513266285875
MAE: 19.531834216395897
RMSE: 1959.3984646747656
----------------------------------------------------------------------------------------------------

Lasso : 0.6283991252116943
R2 Score: 0.6283991252116943
MAE: 25.673824188538934
RMSE: 3708.2714694726137
----------------------------------------------------------------------------------------------------

/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: divide by zero encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: overflow encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: invalid value encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:203: RuntimeWarning: divide by zero encountered in matmul
  ret = a @ b
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:203: RuntimeWarning: overflow encountered in matmul
  ret = a @ b
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/utils/extmath.py:203: RuntimeWarning: invalid value encountered in matmul
  ret = a @ b
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: divide by zero encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: overflow encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: invalid value encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: divide by zero encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: overflow encountered in matmul
  return X @ coef_ + self.intercept_
/Users/dhanrajtentu/Library/Python/3.9/lib/python/site-packages/sklearn/linear_model/_base.py:279: RuntimeWarning: invalid value encountered in matmul
  return X @ coef_ + self.intercept_

Random Forest Regressor : 0.7545562144309776
R2 Score: 0.7545562144309776
MAE: 17.819668204806867
RMSE: 2449.327353988249
----------------------------------------------------------------------------------------------------

In [138]:
import pickle

In [139]:
pickle.dump(pipe, open('linearmodel.pkl','wb'))